Documents/бит_НачислениеПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеПоЛицевымСчетам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КоличествоДнейСобственности</xr:Item>
				<xr:Item>InformationRegister.бит_СведенияОНормативахНачисленийЗакрытогоПериода</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОбъемыПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоКоличествуДнейПроживания</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающихВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающихНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативПотребленияПоКу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПоПроживающим</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПоДнямПраваСобственности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_НачислениеПоЛицевымСчетам/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаСервере
Процедура ВызватьРасчет()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.РассчитатьНачисленияПоЛицевымСчетам();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Функция возвращает ответ на вопрос об очисте таб части.
//
&НаКлиенте
Процедура ЗадатьВопросНаОчисткуТабЧасти(НачальноеЗначение, ВыбранноеЗначение)
	
	Если НачальноеЗначение <> ВыбранноеЗначение Тогда
		
		Если ПолучитьЛицевыеСчетаКоличествоНаСервере() > 0 Тогда
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросНаОчисткуТабЧастиЗавершение", ЭтотОбъект,Новый Структура("ВыбранноеЗначение",ВыбранноеЗначение)), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список зданий " Тогда
			
			Объект.Здание = ВыбранноеЗначение;
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список улиц " Тогда
			
			Объект.Улица = ВыбранноеЗначение;
			Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросНаОчисткуТабЧастиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
	
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
		ОчиститьЛицевыеСчетаНаСервере();
		
		Если  Строка(Типзнч(ВыбранноеЗначение)) = "Список зданий " Тогда
			
			Объект.Здание = ВыбранноеЗначение;
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список улиц " Тогда
			
			Объект.Улица = ВыбранноеЗначение;
			Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
			
		КонецЕсли;
			
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Массив = Новый Массив();
	Массив.Добавить(Тип("СправочникСсылка.бит_Проживающие"));
	ОписаниеТипаПроживающие = Новый ОписаниеТипов(Массив);
	Элементы.НачисленияПоПроживающимФизЛицо.ОграничениеТипа = ОписаниеТипаПроживающие;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормыДокумента();
	
	мКэшЗначений.Дата = Объект.Дата;
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.ЛицевыеСчета.Высота = 0;
		Элементы.ЛицевыеСчета.РастягиватьПоВертикали = Истина; 
		
		Элементы.НачисленияПоПроживающим.Высота = 0;
		Элементы.НачисленияПоПроживающим.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура ВыполнитьРасчет(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьРасчетЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВызватьРасчет();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчетЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВызватьРасчет();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПроверитьНомерДокументаНаСервере();
	
	мКэшЗначений.Дата = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	ЗданиеУлица = ПолучитьЗданиеУлицаНаСервере(Объект.Здание);
	
	Если ЗданиеУлица <> Объект.Улица Тогда
		
		Объект.Здание = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Объект.Улица, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Улица = ПолучитьЗданиеУлицаНаСервере(Объект.Здание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Объект.Здание, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетАбонентаПриИзменении(Элемент)
	
	СтрокаЭлемент = Элементы.ЛицевыеСчета.ТекущийЭлемент;
	СтрокаПлатеж  = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(Форма)
	
	СтрокаПлатеж       = Форма.Объект.ЛицевыеСчета.НайтиПоИдентификатору(Форма.Элементы.ЛицевыеСчета.ТекущаяСтрока);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "ЛицевыеСчетаСубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "ЛицевыеСчетаСубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"ЛицевыеСчетаСубконто" + Постфикс + "1", 
	"ЛицевыеСчетаСубконто" + Постфикс + "2", 
	"ЛицевыеСчетаСубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНомерДокументаНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_НачислениеПоЛицевымСчетам"));
	
	бит_РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ДокументОбъект, мКэшЗначений.Дата);
	
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗданиеУлицаНаСервере(Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаСервере
Функция ПолучитьЛицевыеСчетаКоличествоНаСервере()
	
	Возврат Объект.ЛицевыеСчета.Количество();
	
КонецФункции

&НаСервере
Процедура ОчиститьЛицевыеСчетаНаСервере()
	
	Объект.ЛицевыеСчета.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти
